<?php

namespace Database\Seeders;

use App\Models\Education\Faculty;
use App\Models\Education\Level;
use App\Models\Education\Form;
use App\Models\Education\Department;
use App\Models\Education\Speciality;
use Illuminate\Database\Seeder;

class EducationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        /* Формы / Forms */
        $list = [
            [
                "name"          => "Очная",
                "sort"          => "100",
            ],
            [
                "name"          => "Очно-заочная",
                "sort"          => "200",
            ],
            [
                "name"          => "Заочная",
                "sort"          => "300",
            ],
        ];

        foreach ($list as $item)
            Form::firstOrCreate($item,$item);

        /* Уровни / Levels */
        $list = [
            [
                "name"          => "Бакалавриат",
                "sort"          => "100",
            ],
            [
                "name"          => "Специалитет",
                "sort"          => "200",
            ],
            [
                "name"          => "Магистратура",
                "sort"          => "300",
            ],
        ];

        foreach ($list as $item)
            Level::firstOrCreate($item,$item);

        /* Факультеты / Faculties */
        $list = [
            [
                "id"    => 1,
                "name"  => "Технический факультет",
            ],
            [
                "id"    => 2,
                "name"  => "Агротехнологический факультет",
            ],
            [
                "id"    => 3,
                "name"  => "Гуманитарно-педагогический факультет",
            ],
            [
                "id"    => 4,
                "name"  => "Факультет естественных наук",
            ],
            [
                "id"    => 5,
                "name"  => "Экономический факультет",
            ],
            [
                "id"    => 6,
                "name"  => "Юридический факультет",
            ],
            [
                "id"    => 7,
                "name"  => "Факультет Туризма и сервиса",
            ],
        ];

        foreach ($list as $item)
            Faculty::firstOrCreate($item,$item);

        /* Кафедры / Departments */
        $list = [
            [
                "name"          => "Электротехника и электромеханика",
                "faculty"       => "1",
            ],
            [
                "name"          => "Электроэнергетика имени профессора И.П. Назаренко",
                "faculty"       => "1",
            ],
            [
                "name"          => "Прикладная механика и робототехника",
                "faculty"       => "1",
            ],
            [
                "name"          => "Инженерные дисциплины",
                "faculty"       => "1",
            ],
            [
                "name"          => "Гражданская безопасность",
                "faculty"       => "1",
            ],
            [
                "name"          => "Прикладная математика и информационные технологии имени профессора В.М. Найдыша",
                "faculty"       => "1",
            ],
            [
                "name"          => "Эксплуатация технических средств и комплексов",
                "faculty"       => "1",
            ],
            [
                "name"          => "МелГУ – ООО «МДК»",
                "faculty"       => "1",
            ],
            [
                "name"          => "МелГУ – ООО «МЕЛТ»",
                "faculty"       => "1",
            ],
            [
                "name"          => "Технология и оборудование пищевых производств",
                "faculty"       => "2",
            ],
            [
                "name"          => "Растениеводство имени профессора В.В. Калитки",
                "faculty"       => "2",
            ],
            [
                "name"          => "Технические системы АПК",
                "faculty"       => "2",
            ],
            [
                "name"          => "Социальная работа",
                "faculty"       => "3",
            ],
            [
                "name"          => "Дошкольное образование",
                "faculty"       => "3",
            ],
            [
                "name"          => "Специальное (дефектологическое) образование",
                "faculty"       => "3",
            ],
            [
                "name"          => "Начальное образование",
                "faculty"       => "3",
            ],
            [
                "name"          => "Музыкальное и хореографическое образование",
                "faculty"       => "3",
            ],
            [
                "name"          => "Физическая культура и спорт",
                "faculty"       => "3",
            ],
            [
                "name"          => "Психология",
                "faculty"       => "3",
            ],
            [
                "name"          => "История",
                "faculty"       => "3",
            ],
            [
                "name"          => "Философия и управление образованием",
                "faculty"       => "3",
            ],
            [
                "name"          => "Педагогика и психолого-педагогическое образование",
                "faculty"       => "3",
            ],
            [
                "name"          => "Биология и биологическое образование",
                "faculty"       => "4",
            ],
            [
                "name"          => "Химия и химическое образование",
                "faculty"       => "4",
            ],
            [
                "name"          => "Географическое образование и лесное дело",
                "faculty"       => "4",
            ],
            [
                "name"          => "Экология и природопользование",
                "faculty"       => "4",
            ],
            [
                "name"          => "Русский язык и литература",
                "faculty"       => "4",
            ],
            [
                "name"          => "Иностранные языки",
                "faculty"       => "4",
            ],
            [
                "name"          => "Высшая математика, физика и методика преподавания физико-математических дисциплин",
                "faculty"       => "4",
            ],
            [
                "name"          => "Здравоохранения и общественного здоровья",
                "faculty"       => "4",
            ],
            [
                "name"          => "Экономика",
                "faculty"       => "5",
            ],
            [
                "name"          => "Финансы и учет",
                "faculty"       => "5",
            ],
            [
                "name"          => "Менеджмент",
                "faculty"       => "5",
            ],
            [
                "name"          => "МелГУ – Госзакупки",
                "faculty"       => "5",
            ],
            [
                "name"          => "Государственно-правовых дисциплин",
                "faculty"       => "6",
            ],
            [
                "name"          => "Гражданско-правовых дисциплин",
                "faculty"       => "6",
            ],
            [
                "name"          => "Уголовно-правовых дисциплин",
                "faculty"       => "6",
            ],
            [
                "name"          => "Туризма и рекреации",
                "faculty"       => "7",
            ],
            [
                "name"          => "Гостиничной и ресторанной деятельности",
                "faculty"       => "7",
            ],
        ];

        foreach ($list as $item)
            Department::firstOrCreate($item,$item);

        /* Специальности / Specialities */
        $list = [
            [
                "code"          => "02.03.02",
                "name"          => "Фундаментальная информатика и информационные технологии (Программирование и информационные технологии)",
                "level"         => "1",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "10.03.01",
                "name"          => "Информационная безопасность (Безопасность компьютерных систем)",
                "level"         => "1",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "13.03.02",
                "name"          => "Электроэнергетика и электротехника (Электроэнергетика, электротехника и электромеханика)",
                "level"         => "1",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "15.03.03",
                "name"          => "Прикладная механика (Компьютерное проектирование и дизайн)",
                "level"         => "1",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "15.03.03",
                "name"          => "Прикладная механика (Цифровые двойники изделий)",
                "level"         => "1",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "15.03.03",
                "name"          => "Прикладная механика (Проектно-конструкторское обеспечение машиностроения)",
                "level"         => "1",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "15.03.06",
                "name"          => "Мехатроника и робототехника (Мехатронные и роботизированные технологические системы и комплексы)",
                "level"         => "1",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "23.03.03",
                "name"          => "Эксплуатация транспортно-технологических машин и комплексов (Эксплуатация транспортно-технологических машин и комплексов)",
                "level"         => "1",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "20.03.01",
                "name"          => "Техносферная безопасность (Безопасность труда)",
                "level"         => "1",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.04",
                "name"          => "Профессиональное обучение (по отраслям) (Информатика и вычислительная техника)",
                "level"         => "1",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "02.04.02",
                "name"          => "Фундаментальная информатика и информационные технологии (Программирование и информационные технологии)",
                "level"         => "3",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "10.04.01",
                "name"          => "Информационная безопасность",
                "level"         => "3",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "13.04.02",
                "name"          => "Электроэнергетика и электротехника (Электроэнергетика, электротехника и электромеханика)",
                "level"         => "3",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "15.04.03",
                "name"          => "Прикладная механика (Компьютерный инжиниринг и вычислительная механика)",
                "level"         => "3",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "20.04.01",
                "name"          => "Техносферная безопасность (Управление безопасностью труда)",
                "level"         => "3",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.04",
                "name"          => "Профессиональное обучение (по отраслям) (Информатика, вычислительная техника и компьютерные технологии)",
                "level"         => "3",
                "faculty"       => "1",
                "department"    => 1,
            ],
            [
                "code"          => "15.03.02",
                "name"          => "Технологические машины и оборудование (Компьютерный инжиниринг пищевых производств)",
                "level"         => "1",
                "faculty"       => "2",
                "department"    => 1,
            ],
            [
                "code"          => "19.03.02",
                "name"          => "Продукты питания из растительного сырья (Технология пищевых продуктов общего и специального назначения)",
                "level"         => "1",
                "faculty"       => "2",
                "department"    => 1,
            ],
            [
                "code"          => "35.03.03",
                "name"          => "Агрохимия и агропочвоведение (Агрохимия и агропочвоведение)",
                "level"         => "1",
                "faculty"       => "2",
                "department"    => 1,
            ],
            [
                "code"          => "35.03.04",
                "name"          => "Агрономия (Агрономия)",
                "level"         => "1",
                "faculty"       => "2",
                "department"    => 1,
            ],
            [
                "code"          => "35.03.05",
                "name"          => "Садоводство (Плодоводство, овощеводство, виноградарство)",
                "level"         => "1",
                "faculty"       => "2",
                "department"    => 1,
            ],
            [
                "code"          => "35.03.06",
                "name"          => "Агроинженерия (Технические системы в агробизнесе)",
                "level"         => "1",
                "faculty"       => "2",
                "department"    => 1,
            ],
            [
                "code"          => "15.04.02",
                "name"          => "Технологические машины и оборудование (Компьютерный инжиниринг пищевых производств)",
                "level"         => "3",
                "faculty"       => "2",
                "department"    => 1,
            ],
            [
                "code"          => "19.04.02",
                "name"          => "Продукты питания из растительного сырья (Организация, ведение и проектирование технологий пищевых продуктов)",
                "level"         => "3",
                "faculty"       => "2",
                "department"    => 1,
            ],
            [
                "code"          => "35.04.04",
                "name"          => "Агрономия (Агрономия)",
                "level"         => "3",
                "faculty"       => "2",
                "department"    => 1,
            ],
            [
                "code"          => "35.04.06",
                "name"          => "Агроинженерия (Технические системы в агробизнесе)",
                "level"         => "3",
                "faculty"       => "2",
                "department"    => 1,
            ],
            [
                "code"          => "37.03.01",
                "name"          => "Психология (Психология)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "39.03.02",
                "name"          => "Социальная работа (Социальная работа и социальное предпринимательство)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "39.03.03",
                "name"          => "Организация работы с молодежью (Организация работы с молодежью)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.01",
                "name"          => "Педагогическое образование (Дополнительное образование в области хореографического искусства)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.01",
                "name"          => "Педагогическое образование (Музыка)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.01",
                "name"          => "Педагогическое образование (Физическая культура)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.01",
                "name"          => "Педагогическое образование (Начальное образование)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.01",
                "name"          => "Педагогическое образование (Дошкольное образование)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.02",
                "name"          => "Психолого-педагогическое образование (Психология и социальная педагогика)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.03",
                "name"          => "Специальное (дефектологическое) образования (Логопедия)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (История и обществознание)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Начальное образование. Иностранный язык)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Дошкольное образование. Начальное образование)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) Дошкольное образование. Логопедия)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "46.03.01",
                "name"          => "История (История и археология)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "52.03.01",
                "name"          => "Хореографическое искусство (Искусство балетмейстера)",
                "level"         => "1",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "37.04.01",
                "name"          => "Психология (Практическая психология)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "39.04.02",
                "name"          => "Социальная работа (Социальная работа)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "39.04.03",
                "name"          => "Организация работы с молодежью (Межнациональные отношения и профилактика экстремизма в молодежной среде)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (История)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Дошкольное образование)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Начальное образование)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Управление образовательной организацией)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Музыкальное образование)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Теория спорта и технологии спортивной подготовки)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.02",
                "name"          => "Психолого-педагогическое образование (Психология и социальная педагогика)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.03",
                "name"          => "Специальное (дефектологическое) образование (Логопедия)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "46.04.01",
                "name"          => "История (История и археология)",
                "level"         => "3",
                "faculty"       => "3",
                "department"    => 1,
            ],
            [
                "code"          => "04.03.01",
                "name"          => "Химия (Химическая экспертиза и химический анализ в криминалистике)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "05.03.06",
                "name"          => "Экология и природопользование (Экология и природопользование)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "06.03.01",
                "name"          => "Биология (Биомедицина с основами физической реабилитации)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "19.03.01",
                "name"          => "Биотехнология (Биохимия и биотехнология)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "34.03.01",
                "name"          => "Сестринское дело (Медико-организационная и педагогическая деятельность в сфере здравоохранения)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "35.03.01",
                "name"          => "Лесное дело (Лесное и лесопарковое хозяйство)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "35.03.08",
                "name"          => "Водные ресурсы и аквакультура (Водные ресурсы и аквакультура)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "35.03.10",
                "name"          => "Ландшафтная архитектура (Ландшафтное проектирование)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "42.03.05",
                "name"          => "Медиакоммуникации (Медиакоммуникации в коммерческой и социальной сфере)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Физика и математика)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Математика и информатика)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Биология. Безопасность жизнедеятельности)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Химия. Биология)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Биология. Психология)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (География. Экология)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (География. Физическая культура)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Русский язык и литература)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Иностранный язык (английский). Иностранный язык (немецкий))",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Русский язык и иностранный язык)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (Иностранный язык (английский). Информатика)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "45.03.02",
                "name"          => "Лингвистика (Перевод и переводоведение (английский язык))",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "04.04.01",
                "name"          => "Химия (Химико-аналитический контроль и химико-криминалистическая экспертиза)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "05.04.06",
                "name"          => "Экология и природопользование (Устойчивое развитие и охрана природных объектов)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "06.04.01",
                "name"          => "Биология (Биологические основы физической реабилитации)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "06.04.01",
                "name"          => "Биология (Организационно-управленческая деятельность в сфере здравоохранения)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "19.04.01",
                "name"          => "Биотехнология (Биохимия и биотехнология)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "35.04.01",
                "name"          => "Лесное дело (Лесоустройство и управление лесными ресурсами)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "35.04.09",
                "name"          => "Ландшафтная архитектура (Садово-парковое и ландшафтное строительство)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Преподавание иностранных языков и проектирование в иноязычном образовании)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Проектирование педагогических систем в биологическом и химическом образовании)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Инновационные технологии подготовки учителя в образовательной области «Математика и информатика»)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Биология и психология в системе образования)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Технологии обучения в физико-математическом образовании)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Географическое образование и физическая культура)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Теория и практика географического образования и экологического просвещения)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.04.01",
                "name"          => "Педагогическое образование (Русский язык и литература)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "45.04.02",
                "name"          => "Лингвистика (Теория и практика перевода)",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "45.04.02",
                "name"          => "Лингвистика (Лингвистическое обеспечение психологических операций (английский и украинский языки))",
                "level"         => "3",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "38.03.01",
                "name"          => "Экономика (Учет, анализ и аудит)",
                "level"         => "1",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.03.01",
                "name"          => "Экономика (Финансы и кредит)",
                "level"         => "1",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.03.01",
                "name"          => "Экономика (Экономика предприятий и организаций)",
                "level"         => "1",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.03.01",
                "name"          => "Экономика (Цифровая экономика)",
                "level"         => "1",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.03.01",
                "name"          => "Экономика (Экономика агропромышленного комплекса)",
                "level"         => "1",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.03.02",
                "name"          => "Менеджмент (Менеджмент предприятий и организаций)",
                "level"         => "1",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.03.04",
                "name"          => "Государственное и муниципальное управление",
                "level"         => "1",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.03.06",
                "name"          => "Торговое дело (Маркетинг)",
                "level"         => "1",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.05.01",
                "name"          => "Экономическая безопасность (Экономико-правовое обеспечение экономической безопасности",
                "level"         => "2",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.04.01",
                "name"          => "Экономика (Экономика предприятий и организаций)",
                "level"         => "3",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.04.01",
                "name"          => "Экономика (Учет, анализ и аудит)",
                "level"         => "3",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.04.02",
                "name"          => "Менеджмент",
                "level"         => "3",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.04.04",
                "name"          => "Государственное и муниципальное управление",
                "level"         => "3",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.04.06",
                "name"          => "Торговое дело (Маркетинг)",
                "level"         => "3",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "38.04.08",
                "name"          => "Финансы и кредит",
                "level"         => "3",
                "faculty"       => "5",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.01",
                "name"          => "Юриспруденция (Государственно-правовой профиль)",
                "level"         => "1",
                "faculty"       => "6",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.01",
                "name"          => "Юриспруденция (Гражданско-правовой профиль)",
                "level"         => "1",
                "faculty"       => "6",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.01",
                "name"          => "Юриспруденция (Уголовно-правовой профиль)",
                "level"         => "1",
                "faculty"       => "6",
                "department"    => 1,
            ],
            [
                "code"          => "40.05.01",
                "name"          => "Правовое обеспечение национальной безопасности (Гражданско-правовая специализация)",
                "level"         => "2",
                "faculty"       => "6",
                "department"    => 1,
            ],
            [
                "code"          => "40.04.01",
                "name"          => "Юриспруденция",
                "level"         => "3",
                "faculty"       => "6",
                "department"    => 1,
            ],
            [
                "code"          => "19.03.04",
                "name"          => "Технология продукции и организация общественного питания (Технология продукции и управления деятельности гостиниц и ресторанов)",
                "level"         => "1",
                "faculty"       => "7",
                "department"    => 1,
            ],
            [
                "code"          => "43.03.02",
                "name"          => "Туризм (Технология и организация услуг на предприятиях индустрии туризма)",
                "level"         => "1",
                "faculty"       => "7",
                "department"    => 1,
            ],
            [
                "code"          => "19.04.04",
                "name"          => "Технология продукции и организация общественного питания (Стратегическое управление предприятиями сферы гостеприимства и общественного питания)",
                "level"         => "3",
                "faculty"       => "7",
                "department"    => 1,
            ],
            [
                "code"          => "43.04.02",
                "name"          => "Туризм (Организация стратегического управления предприятиями туристической сферы)",
                "level"         => "3",
                "faculty"       => "7",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (География. Биология)",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
            [
                "code"          => "44.03.05",
                "name"          => "Педагогическое образование (с двумя профилями подготовки) (География. Иностранный язык) ",
                "level"         => "1",
                "faculty"       => "4",
                "department"    => 1,
            ],
        ];

        foreach ($list as $item)
            Speciality::firstOrCreate($item,$item);


    }
}
