<div class="">
    <x-news
        :news="(object)[
            'title'         => 'Пример новости',
            'date'          => '03.12.2024',
            'short'         => 'Давно выяснено, что при оценке дизайна ',
            'full'          => 'Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает ',
            'preview'       => asset('img/Frame262.jpg'),
        ]"
    />

    <x-news
        :news="(object)[
            'title'         => 'Пример новости',
            'date'          => '03.12.2024',
            'short'         => 'Давно выяснено, что при оценке дизайна ',
            'full'          => 'Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает ',
            'preview'       => asset('img/image-3.jpg'),
        ]"
    />

    <x-news
        :news="(object)[
            'title'         => 'Пример новости',
            'date'          => '03.12.2024',
            'short'         => 'Давно выяснено, что при оценке дизайна ',
            'full'          => 'Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает ',
            'preview'       => asset('img/image-2.jpg'),
        ]"
    />

    <x-news
        :news="(object)[
            'title'         => 'Пример новости',
            'date'          => '03.12.2024',
            'short'         => 'Давно выяснено, что при оценке дизайна ',
            'full'          => 'Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает ',
            'preview'       => asset('img/image-1.jpg'),
        ]"
    />

</div>
